package JavaProgrammStructure;

public class HelloJava {
    //Напишите программу, которая выводит на экран строку "Hello, Java!" (без кавычек)
    public static void  main(String [] args){
        System.out.println("Hello, Java!");
    }
}
